In [28]:
library(RMySQL)

In [29]:
conn <- dbConnect(MySQL(),
                dbname = 'RSQL',
                 user = 'root',
                 password = 'qwer1234',
                 host = '127.0.0.1'
                )

In [30]:
# insert
dbSendQuery(conn, 'insert into score values (1,100,100,100)')

result = dbGetQuery(conn, 'select * from score')

In [31]:
dbSendQuery(conn,'insert into score values (2,90,90,90)')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathmatics
1 1  100    100     100
2 2   90     90      90

In [32]:
# update
dbSendQuery(conn,'update score set korean=90, english=80, mathmatics=70 where id=2')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathmatics
1 1  100    100     100
2 2   90     80      70

In [33]:
# delete
dbSendQuery(conn,'delete from score where id=2')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathmatics
1 1  100    100     100

In [34]:
#
data <- read.csv("../Data/score.csv", header = F)
colnames(data) <- c('id','korean','english','mathmatics')
data

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [36]:
dbWriteTable(conn, "score", data, overwrite=T, row.names=F) # append=T

[1] TRUE

In [37]:
result = dbGetQuery(conn, 'select * from score')
result

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [38]:
data2 <- read.csv("../Data/score2.csv", header = F)
colnames(data2) <- c('id','korean','english','mathmatics')
data2

  id korean english mathmatics
1 11 90     80      70
2 12 90     88      70

In [39]:
dbWriteTable(conn, "score", data, overwrite=F, row.names=F, append=T) # append=T

[1] TRUE

In [40]:
result = dbGetQuery(conn, 'select * from score')
result

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11  1  90     80      70
12  2  90     88      70
13  3  90     89      70
14  4  90     87      70
15  5  90     60      70
16  6 100    100     100
17  7 100    100     100
18  8 100    100     100
19  9 100    100     100
20 10 100    100     100

In [41]:
# Disconnect
dbDisconnect(conn)

[1] TRUE